'''
Задание 4
Выведите на экран надпись To be or not to be на разных строках. Пример вывода:
            To be
            or not
            to be
'''
peremen = '\t\t\tTo be\n\t\t\tor not\n\t\t\tto be'
print(peremen)

