# Задание 1
# Пользователь вводит с клавиатуры три числа. Необходимо найти сумму чисел, произведение чисел. Результат
# вычислений вывести на экран.
# Введите значение первого из трех чисел
# Введите значение второго из трех чисел
# Введите значение третьего из трех чисел
# Enter the value of the first of three numbers
# Enter the value of the second of three numbers
# Enter the value of the third of three numbers
number1 = float(input("Enter the value of the first of three numbers : "))
number2 = float(input("Enter the value of the second of three numbers : "))
number3 = float(input("Enter the value of the third of three numbers : "))
sum_of_numbers = number1 + number2 + number3
product_of_numbers = number1 * number2 * number3
print("Sum of numbers =", sum_of_numbers)
print("Product of numbers =", product_of_numbers)

